import React, { useEffect, useState } from "react";
import axios from "axios";

//Styles
import styles from "./Blogs.module.css";

//Components
import BreadcrumbBlogs from "./blogs/BreadcrumbBlogs";
import AnyBlog from "./blogs/AnyBlog";
import Loading from "./shared/Loading";

//Images
import blog1 from '../assets/img/blog1.jpg'
import blog2 from '../assets/img/blog2.jpg'
import blog3 from '../assets/img/blog3.jpg'
import blog4 from '../assets/img/1.jpg'

const Blogs = () => {

  const blogs = [
    {
      id:1,
      title: "استایل های جدید با جردن های جدید 2022",
      date:"۲۹ فروردین ۱۴۰۱ | ۱۶:۰۰",
      author :"مهرداد ترکی",
      image : blog1,
      description :"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
      categories : "استایل آقایان",
      tags : ["استایل","بانوان","استایل برتر" , "آقایان" ]
    },
    {
      id:2,
      title: "رنگهای جدید و ریلیز شده برند جردن مدل jordan1",
      date:"۲۹ فروردین ۱۴۰۱ | ۱۶:۰۰",
      author :"مهرداد ترکی",
      image : blog2,
      description :"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
      categories : "رنگ جدید",
      tags : ["استایل","بانوان","رنگ جدید","جدید","استایل برتر" ]
    },
    {
      id:3,
      title: "مروری خلاصه و کوتاه بر زندگی مایک جردن",
      date:"۲۹ فروردین ۱۴۰۱ | ۱۶:۰۰",
      author :"مهرداد ترکی",
      image : blog3,
      description :"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
      categories : "زندگینامه",
      tags : ["مایکل جردن","زندگینامه","بسکتبالیست","ورزشکار" ]
    },
    {
      id:4,
      title: "چرا مدل های off-white جزو پرفروشترین مدلها هستند؟",
      date:"۲۹ فروردین ۱۴۰۱ | ۱۶:۰۰",
      author :"مهران عزیزی",
      image : blog4,
      description :"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
      categories : "استایل بانوان",
      tags : ["off-white","پرفروش","جردن 5","jordan5" ]
    }
  ]

  return (
    <div className="container">
      <BreadcrumbBlogs />
      <div className={blogs.length ? styles.blogs : ""}>
        {blogs.length ? (
          blogs.map((blog) => <AnyBlog key={blog.id} data={blog} />)
        ) : (
          <Loading />
        )}
      </div>
    </div>
  );
};

export default Blogs;
